# Handling Missing Data with pandas

*pandas borrows all the capabilites from numpy selection + adds a number of convieniant methods to handle missing values*

In [2]:
import numpy as np
import pandas as pd

* Similarly to numpy, pandas also have utility functions to identify and detect null values

In [3]:
pd.isnull(np.nan)
pd.isnull(None)
pd.isna(np.nan)
pd.isna(None)

True

* The opposite ones also exit

In [4]:
pd.notnull(np.nan)
pd.notnull(None)
pd.notnull(3)

True

* These functions also work with series and dataframes

In [5]:
pd.isnull(pd.Series([1, np.nan, 7]))

0    False
1     True
2    False
dtype: bool

In [6]:
pd.notnull(pd.Series([1, np.nan, 7]))

0     True
1    False
2     True
dtype: bool

In [7]:
pd.isnull(pd.DataFrame({
    'Column A': [1, np.nan, 7],
    'Column B': [np.nan, 2, 3],
    'Column C': [1, 1, 1]
}))

   Column A  Column B  Column C
0     False      True     False
1      True     False     False
2     False     False     False

## pandas operations with missing values

* pandas manages missing values more gracefully than numpy nan s will no longer behave as 'viruses' and operations will just ignore them completely

In [8]:
pd.Series([1, np.nan, 7]).count()

np.int64(2)

In [9]:
pd.Series([1, np.nan, 7]).sum()

np.float64(8.0)

In [10]:
pd.Series([1, np.nan, 7]).mean()

np.float64(4.0)

## filtering missing data

* we could combine boolean selection + pd.isnull to filter out those nan s and null values

In [11]:
s = pd.Series([1, 2, 3, np.nan, 6, np.nan])

In [12]:
pd.notnull(s)

0     True
1     True
2     True
3    False
4     True
5    False
dtype: bool

In [13]:
pd.notnull(s).count()

np.int64(6)

In [14]:
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
4    6.0
dtype: float64

* both notnull and isnull are also methods of Series and DataFrames so we could use it that way

In [15]:
s.isnull()

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [16]:
s.notnull

<bound method Series.notnull of 0    1.0
1    2.0
2    3.0
3    NaN
4    6.0
5    NaN
dtype: float64>

In [17]:
s[s.notnull()]

0    1.0
1    2.0
2    3.0
4    6.0
dtype: float64

## Dropping Null values

In [18]:
s.dropna()

0    1.0
1    2.0
2    3.0
4    6.0
dtype: float64

## Dropping null values in DataFrames

In [19]:
df = pd.DataFrame({
    'Column A': [1, np.nan, 30],
    'Column B': [2, 8, 31],
    'Column C': [np.nan, 9, 32],
    'Column D': [4, 10, 33]
})

In [20]:
df

   Column A  Column B  Column C  Column D
0       1.0         2       NaN         4
1       NaN         8       9.0        10
2      30.0        31      32.0        33

In [21]:
df.isnull()

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False

In [22]:
df.isnull().sum()

Column A    1
Column B    0
Column C    1
Column D    0
dtype: int64

- default dropna behavior will drop all rows in which  the null value is present

In [23]:
df.dropna()

   Column A  Column B  Column C  Column D
2      30.0        31      32.0        33

In [24]:
df.dropna(axis=1)

   Column B  Column D
0         2         4
1         8        10
2        31        33

In [25]:
df2 = pd.DataFrame({
    'Column A': [1, np.nan, 30],
    'Column B': [2, 8, 31],
    'Column C': [np.nan, 9, 32],
    'Column D': [4, 10, 33]
})

In [26]:
df2

   Column A  Column B  Column C  Column D
0       1.0         2       NaN         4
1       NaN         8       9.0        10
2      30.0        31      32.0        33

In [27]:
df.dropna(how = 'all')

   Column A  Column B  Column C  Column D
0       1.0         2       NaN         4
1       NaN         8       9.0        10
2      30.0        31      32.0        33

In [28]:
df.dropna(how = 'any')

   Column A  Column B  Column C  Column D
2      30.0        31      32.0        33

In [29]:
df

   Column A  Column B  Column C  Column D
0       1.0         2       NaN         4
1       NaN         8       9.0        10
2      30.0        31      32.0        33

In [30]:
df.dropna(thresh=3)

   Column A  Column B  Column C  Column D
0       1.0         2       NaN         4
1       NaN         8       9.0        10
2      30.0        31      32.0        33

In [31]:
df.dropna(thresh=3, axis=1)

   Column B  Column D
0         2         4
1         8        10
2        31        33

## Finding Null Values

In [32]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    6.0
5    NaN
dtype: float64

- Filling null values

In [33]:
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    6.0
5    0.0
dtype: float64

In [34]:
s.fillna(s.mean())

0    1.0
1    2.0
2    3.0
3    3.0
4    6.0
5    3.0
dtype: float64

In [35]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    6.0
5    NaN
dtype: float64

- filling null with contiguous (close) values

In [36]:
s.fillna(method='ffill')

C:\Users\Vaibhav\AppData\Local\Temp\ipykernel_2540\1029756637.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s.fillna(method='ffill')

0    1.0
1    2.0
2    3.0
3    3.0
4    6.0
5    6.0
dtype: float64

In [37]:
s.fillna(method='bfill')

C:\Users\Vaibhav\AppData\Local\Temp\ipykernel_2540\1641295691.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s.fillna(method='bfill')

0    1.0
1    2.0
2    3.0
3    6.0
4    6.0
5    NaN
dtype: float64

- this can leave values at the extremes of the Series and Dataframes

In [38]:
pd.Series([np.nan, 1, 2, np.nan, 3]).fillna(method='ffill')

C:\Users\Vaibhav\AppData\Local\Temp\ipykernel_2540\898783379.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  pd.Series([np.nan, 1, 2, np.nan, 3]).fillna(method='ffill')

0    NaN
1    1.0
2    2.0
3    2.0
4    3.0
dtype: float64

In [39]:
pd.Series([np.nan, 1, 2, np.nan, 3]).fillna(method='bfill')

C:\Users\Vaibhav\AppData\Local\Temp\ipykernel_2540\3685263614.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  pd.Series([np.nan, 1, 2, np.nan, 3]).fillna(method='bfill')

0    1.0
1    1.0
2    2.0
3    3.0
4    3.0
dtype: float64

## Filling Null values on DataFrames

In [40]:
df

   Column A  Column B  Column C  Column D
0       1.0         2       NaN         4
1       NaN         8       9.0        10
2      30.0        31      32.0        33

In [41]:
df.fillna({'Column A': 0, 'Column B': 99, 'Column C': df['Column C'].mean()})

   Column A  Column B  Column C  Column D
0       1.0         2      20.5         4
1       0.0         8       9.0        10
2      30.0        31      32.0        33

In [42]:
df.fillna(method='ffill', axis=0)

C:\Users\Vaibhav\AppData\Local\Temp\ipykernel_2540\3122255136.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', axis=0)

   Column A  Column B  Column C  Column D
0       1.0         2       NaN         4
1       1.0         8       9.0        10
2      30.0        31      32.0        33

In [43]:
df.fillna(method='ffill', axis=1)

C:\Users\Vaibhav\AppData\Local\Temp\ipykernel_2540\901808322.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', axis=1)

   Column A  Column B  Column C  Column D
0       1.0       2.0       2.0       4.0
1       NaN       8.0       9.0      10.0
2      30.0      31.0      32.0      33.0

## Checking if there are NaNs

- Example 1 : Checking the length
- if there are missing values s.dropna() will have less elements than s:

In [44]:
s.dropna().count()

np.int64(4)

In [45]:
missing_values = len(s.dropna()) != len(s)
missing_values

True

*There's also a count method, that excludes nans from its result*

In [46]:
len(s)

6

In [47]:
s.count()

np.int64(4)

In [48]:
missing_values = s.count() != len(s)
missing_values

np.True_

### More Pythonic solution any

In [49]:
pd.Series([True, False, True]).any()

np.True_

In [50]:
pd.Series([True, False, False]).all()

np.False_

In [51]:
pd.Series([True, True, True]).any()

np.True_

*The isnull() method returned a Boolean Series with True values wherever there was a nan*

In [52]:
s.isnull()

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [53]:
pd.Series([1, np.nan]).isnull().any()

np.True_

In [54]:
pd.Series([1, 2]).isnull().any()

np.False_

In [55]:
s.isnull().any()

np.True_

In [56]:
s.isnull().values

array([False, False, False,  True, False,  True])

In [57]:
s.isnull().values.any()

np.True_